# CannotDrawBlend Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BlendFailures..::..CannotDrawBlend Property
BuiltInFailures..::..BlendFailures Class See Also
---
Can't create blend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawBlend { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawBlend As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawBlend {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..BlendFailures Class
Autodesk.Revit.DB Namespace